# Pandas 시작- 파일을 DataFrame 로딩, 기본 API

### 모듈 import

In [1]:
import pandas as pd

### read_csv()

csv 파일을 읽어와 데이터프레임(DataFrame) 형태로 반환

In [5]:
titanic_df = pd.read_csv('titanic_train.csv')
print('titanic 변수 type:',type(titanic_df))
titanic_df

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### head()

DataFrame의 상위 일부 행을 반환, 기본값은 5

In [9]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### shape

DataFrame의 행과 열을 튜플 형태로 반환

- 행: 데이터 건수
- 열: 컬럼(속성)의 수

In [10]:
print('DataFrame 크기: ', titanic_df.shape)

DataFrame 크기:  (891, 12)

### info()

DataFrame의 각 열에 대한 정보를 요약하여 출력
- 열의 이름
- 열의 데이터 타입
- 열에 포함된 값의 개수 (결측치 제외)
- 메모리 사용량

In [11]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### describe()

DataFrame의 수치형 열에 대한 통계적 요약 정보를 제공
- count: 열에 포함된 값의 개수
- mean: 평균값
- std: 표준편차
- min: 최솟값
- 25%, 50%, 75%: 각각 1사분위수(Q1), 중앙값(Q2), 3사분위수(Q3)
- max: 최댓값

In [12]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### value_counts()

DataFrame의 열에서 각 고유한 값의 빈도를 확인 가능, 데이터 분포도를 확인하는 데 유용

In [14]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

**시리즈(Series)**: index와 **단 하나의 컬럼**으로 구성된 데이터 세트

In [15]:
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

<class 'pandas.core.series.Series'>

In [16]:
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

**value_counts()** 메서드는 고유한 값들의 빈도를 계산하여 **시리즈(Series)** 객체로 반환

In [19]:
value_counts = titanic_df['Pclass'].value_counts()
print(type(value_counts))
print(value_counts)

<class 'pandas.core.series.Series'>
Pclass
3    491
1    216
2    184
Name: count, dtype: int64

**dropna**: 결측치(누락된 값)가 있는 행을 결과에서 제외할지 결정, 기본값은 True -> NaN(Not a Number) 값은 빈도 계산에서 제외

In [24]:
print('titanic_df 데이터 건수:', titanic_df.shape[0])

print('기본 설정인 dropna=True로 value_counts()')
print(titanic_df['Embarked'].value_counts()) # dropna=True
print(titanic_df['Embarked'].value_counts(dropna=False)) # 결측치까지 count, NaN 값을 가진 행도 포함하여 빈도를 계산

titanic_df 데이터 건수: 891
기본 설정인 dropna=True로 value_counts()
Embarked
S    644
C    168
Q     77
Name: count, dtype: int64
Embarked
S      644
C      168
Q       77
NaN      2
Name: count, dtype: int64

# DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환

## 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기

In [ ]:
import numpy as np

col_name1=['col1']
list1 = [1, 2, 3]

### 리스트를 이용해 넘파이 ndarray 생성

In [30]:
array1 = np.array(list1)
print('array1 shape:', array1.shape)

array1 shape: (3,)

### 리스트를 이용해 DataFrame 생성

columns : 열(column)의 이름을 지정

In [32]:
df_list1 = pd.DataFrame(list1, columns=col_name1) # 열의 이름을 col_name1 리스트의 값인 'col1'으로 지정
print('1차원 리스트로 만든 DataFrame:\n', df_list1)

1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3

### 넘파이 ndarray를 이용해 DataFrame 생성

columns : 열(column)의 이름을 지정

In [28]:
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 ndarray로 만든 DataFrame:\n', df_array1)

1차원 ndarray로 만든 DataFrame:
    col1
0     1
1     2
2     3

### 컬럼이 여러 개인 경우

In [37]:
# 3개의 칼럼명이 필요
col_name2=['col1', 'col2', 'col3']

# 2행x3열 형태의 리스트
list2 = [[1, 2, 3],
         [11, 12, 13]]

# 리스트 -> 넘파이 ndarray
array2 = np.array(list2)
print('array2 shape:', array2.shape )

# 리스트 -> DataFrame
df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원 리스트로 만든 DataFrame:\n', df_list2)

# 넘파이 ndarray -> DataFrame
df_array2 = pd.DataFrame(array2, columns=col_name2)
print('2차원 ndarray로 만든 DataFrame:\n', df_array2)

array2 shape: (2, 3)
2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

### 딕셔너리를 DataFrame으로 변환

- Key: 컬럼명으로 매핑
- Value: 리스트 형 또는 ndarray

In [39]:
dict = {'col1':[1, 11], 'col2':[2, 22], 'col3':[3, 33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

## DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기

### DataFrame을 ndarray로 변환 : values

values 속성을 사용하여 DataFrame을 ndarray로 변환

In [42]:
array3 = df_dict.values
print('df_dict.values 타입:', type(array3), 'df_dict.values shape:', array3.shape)
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 22 33]]

### DataFrame을 리스트로 변환 : tolist()

tolist() 메서드를 사용하여 DataFrame을 리스트로 변환

In [45]:
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:', type(list3))
print(list3)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 22, 33]]

### DataFrame을 딕셔너리로 변환 : to_dict()

to_dict() 메서드를 사용하여 DataFrame을 딕셔너리로 변환

In [44]:
dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() 타입:', type(dict3))
print(dict3)

 df_dict.to_dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

## DataFrame의 컬럼 데이터 셋 Access

### 새로운 컬럼(데이터) 생성

In [64]:
# 'Age_0'라는 새로운 열을 추가하고, 해당 열의 모든 값에 0을 할당
titanic_df['Age_0']=0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

### 기존 컬럼을 조합하여 생성

In [65]:
# 'Age_by_10'라는 새로운 열을 추가하고, 'Age_by_10' 열의 값에서 10을 곱한 값을 해당 열에 할당
titanic_df['Age_by_10'] = titanic_df['Age']*10

# 'Family_No'라는 새로운 열을 추가하고, 'SibSp' 열의 값과 'Parch' 열의 값을 더한 값을 해당 열에 할당
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch']+1

titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [66]:
# 'Age_by_10' 열의 값을 100만큼 더한 값을 해당 열에 할당
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100

titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

## DataFrame 데이터 삭제

### drop() 함수

DataFrame에서 특정 행이나 열을 제거하는 메서드

**df.drop(labels, axis=0/1, inplace=False)**

- labels: 제거할 행이나 열의 인덱스 또는 라벨을 지정
- axis: 제거할 방향을 지정 -> 0일 경우 행(row)을 제거하며, 1일 경우 열(column)을 제거
- inplace: True로 설정하면 원본 데이터프레임을 변경, False로 설정하면 변경된 데이터프레임을 반환 (기본값은 False)

In [67]:
# 'Age_0' 열을 제거한 데이터프레임을 반환
titanic_drop_df = titanic_df.drop('Age_0', axis=1 )

titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0,1

In [68]:
# 기존 데이터프레임은 바뀌지 않음
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

In [69]:
# 원본 데이터프레임에서 'Age_0', 'Age_by_10', 'Family_No' 열들을 제거
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis=1, inplace=True)

print(' inplace=True 로 drop 후 반환된 값:',drop_result)

titanic_df.head(3)

 inplace=True 로 drop 후 반환된 값: None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [70]:
# 데이터프레임을 출력할 때 가로 폭을 1000으로 설정
pd.set_option('display.width', 1000)
# 데이터프레임의 각 열의 너비를 최대 15로 설정
pd.set_option('display.max_colwidth', 15)

print('#### before axis 0 drop ####')
print(titanic_df.head(3))

# 원본 데이터프레임에서 인덱스가 0, 1, 2인 행을 제거
titanic_df.drop([0,1,2], axis=0, inplace=True)

print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

## Index 객체

### 원본 파일 재 로딩

In [71]:
titanic_df = pd.read_csv('titanic_train.csv')

### Index 객체 추출

RangeIndex(start, stop, step)

In [73]:
indexes = titanic_df.index
print(indexes)

RangeIndex(start=0, stop=891, step=1)

### Index 객체를 실제 값 arrray로 변환

values를 이용하여 Index 객체에 포함된 인덱스 레이블들을 ndarray 형태로 변환

In [76]:
print('Index 객체 array값:\n',indexes.values)

Index 객체 array값:
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

### 단일값 반환 및 슬라이싱 가능

In [79]:
print(type(indexes.values)) # ndarray 형태
print(indexes.values.shape) # 0부터 890번째 인덱스 존재 -> 1차원, 891개의 행
print(indexes[:5].values) # Index 객체의 처음 5개의 인덱스 레이블을 가져와서 배열 형태로 출력
print(indexes.values[:5]) # Index 객체에 포함된 모든 인덱스 레이블을 배열 형태로 가져온 다음, 처음 5개의 값을 선택하여 출력
print(indexes[6]) # Index 객체의 6번째(0번째부터 시작) 인덱스 레이블을 반환

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

### index 객체는 immutable

In [80]:
indexes[0] = 5

TypeError: Index does not support mutable operations

**index 객체는 각 행을 고유하게 식별하는 역할만 한다**

In [82]:
# 'Fare' 열에 해당하는 Series를 추출하여 series_fair 변수에 할당
series_fair = titanic_df['Fare']

# Fair Series에서의 최대값을 출력
print('Fair Series max 값:', series_fair.max())

# Fair Series의 합계를 출력
print('Fair Series sum 값:', series_fair.sum())

# 파이썬 내장 함수인 sum()을 사용하여 Fair Series의 합계를 계산하고 출력
print('sum() Fair Series:', sum(series_fair))

# Fair Series의 각 값에 3을 더하고 첫 3개의 값을 출력
print('Fair Series + 3:\n',(series_fair + 3).head(3) )

Fair Series max 값: 512.3292
Fair Series sum 값: 28693.9493
sum() Fair Series: 28693.949299999967
Fair Series + 3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

### reset_index()

DataFrame의 인덱스를 재설정

**df.reset_index(drop=False, inplace=False)**

- drop: 기존 인덱스를 데이터프레임의 열로 유지(새로운 칼럼명으로 추가)할지 여부를 결정, 기본값은 False (기존 인덱스를 열로 유지)
- inplace: True로 설정하면 원본 데이터프레임을 변경, 기본값은 False (변경된 데이터프레임을 반환)

In [85]:
# 새로운 인덱스는 숫자형으로 할당하며 기존 인덱스를 새로운 칼럼명('index')으로 추가
titanic_reset_df = titanic_df.reset_index(inplace=False)

titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [86]:
# 'Pclass' 열의 값들을 기준으로 빈도를 계산하여 시리즈로 추출
print('### before reset_index ###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts 객체 변수 타입:',type(value_counts))

# reset_index() 메서드를 사용하여 시리즈의 인덱스를 기본 정수 인덱스로 재설정하고, 시리즈를 데이터프레임으로 변환
new_value_counts = value_counts.reset_index(inplace=False)
print('### After reset_index ###')
print(new_value_counts)
print('new_value_counts 객체 변수 타입:',type(new_value_counts))

### before reset_index ###
Pclass
3    491
1    216
2    184
Name: count, dtype: int64
value_counts 객체 변수 타입: <class 'pandas.core.series.Series'>
### After reset_index ###
   Pclass  count
0       3    491
1       1    216
2       2    184
new_value_counts 객체 변수 타입: <class 'pandas.core.frame.DataFrame'>

# 데이터 셀렉션 및 필터링

## DataFrame의 [ ] 연산자

### 1. 컬럼명

컬럼만 지정 가능, 컬럼명이 아닐 경우 오류 발생

**단일 컬럼 데이터 추출**

In [89]:
print('단일 컬럼 데이터 추출:\n', titanic_df[ 'Pclass' ].head(3))

단일 컬럼 데이터 추출:
 0    3
1    1
2    3
Name: Pclass, dtype: int64

**여러 컬럼 데이터 추출**

In [90]:
print('\n여러 컬럼들의 데이터 추출:\n', titanic_df[ ['Survived', 'Pclass'] ].head(3))

여러 컬럼들의 데이터 추출:
    Survived  Pclass
0         0       3
1         1       1
2         1       3

**컬럼명이 아닐 경우 오류**

In [87]:
print('[ ] 안에 숫자 index는 KeyError 오류 발생:\n', titanic_df[0])

단일 컬럼 데이터 추출:
 0    3
1    1
2    3
Name: Pclass, dtype: int64

여러 컬럼들의 데이터 추출:
    Survived  Pclass
0         0       3
1         1       1
2         1       3

KeyError: 0

### 2. 판다스의 인덱스 형태로 변환 가능한 표현식

DataFrame에서 행(row)을 슬라이싱하여 원하는 범위의 행을 선택

In [88]:
titanic_df[0:2]

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0   PC 17599  71.2833   C85        C

### 3. 불린 인덱싱

불린 인덱싱을 사용하여 조건을 만족하는 행을 선택

In [92]:
# titanic_df['Pclass'] == 3으로 'Pclass' 열의 값이 3인지 여부에 대한 불린 시리즈를 생성, True인 행만 추출
titanic_df[ titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S

## DataFrame iloc[ ] 연산자 : 위치 기반

**정수형 인덱스**를 사용하여 DataFrame의 특정 행과 열을 선택 -> [행, 열]

In [93]:
data = {'Name': ['Chulmin', 'Eunkyung','Jinwoong','Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']
       }

# pd.DataFrame() 함수를 사용하여 딕셔너리 data를 데이터프레임으로 변환
data_df = pd.DataFrame(data, index=['one','two','three','four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [95]:
# 0번째 행의 0번째 열을 선택
data_df.iloc[0, 0]

'Chulmin'

iloc는 **레이블**을 인덱스로 사용하지 않음

In [98]:
# 아래 코드는 오류를 발생
data_df.iloc[0, 'Name']
data_df.iloc['one', 0]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [100]:
# 데이터프레임에서 모든 행을 선택하고, 마지막 열만 선택
print("\n 맨 마지막 칼럼 데이터 [:, -1] \n", data_df.iloc[:, -1])

# 데이터프레임에서 모든 행을 선택하고, 마지막 열 전까지(마지막 열만 제외) 선택
print("\n 맨 마지막 칼럼을 제외한 모든 데이터 [:, :-1] \n", data_df.iloc[: , :-1])

 맨 마지막 칼럼 데이터 [:, -1]
 one        Male
two      Female
three      Male
four       Male
Name: Gender, dtype: object

 맨 마지막 칼럼을 제외한 모든 데이터 [:, :-1]
            Name  Year
one     Chulmin  2011
two    Eunkyung  2016
three  Jinwoong  2015
four    Soobeom  2015

## DataFrame loc[ ] 연산자 : 명칭 기반

**레이블**을 사용하여 DataFrame의 특정 행과 열을 선택 -> [행 이름, 열 이름]

In [101]:
data_df.loc['one', 'Name']

'Chulmin'

loc는 **정수형 인덱스**를 인덱스로 사용하지 않음

In [102]:
# 아래 코드는 오류를 발생
data_df_reset.loc[0, 'Name']

NameError: name 'data_df_reset' is not defined

### 위치 기반과 명칭 기반의 차이점

- 위치 기반 인덱싱: stop을 포함하지 않음  
- 명칭 기반 인덱싱: stop도 포함

In [105]:
# 0번째 행의 0번째 열을 선택
print('위치기반 iloc slicing\n', data_df.iloc[0:1, 0],'\n')

# 0~1번째 행('one', 'two')의 'Name' 열을 선택
print('명칭기반 loc slicing\n', data_df.loc['one':'two', 'Name'])

위치기반 iloc slicing
 one    Chulmin
Name: Name, dtype: object

명칭기반 loc slicing
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

## 불린 인덱싱

In [106]:
titanic_df = pd.read_csv('titanic_train.csv')

# titanic_df['Age'] > 60으로 'Age' 열의 값이 60보다 큰지 여부에 대한 불린 시리즈를 생성, True인 행만 추출
titanic_boolean = titanic_df[titanic_df['Age'] > 60]
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr. ...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, Mi...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr. ...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, Mr...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, Mr...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, Mr....    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, Mr...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagaveyti...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson, ...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, Mr....    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, Mr....    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, Mr....    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth, ...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0       347060    7.7750          NaN        S

In [108]:
# 불린 인덱싱한 결과에서 'Name', 'Age' 열만 추출 -> 두 번의 선택 작업
titanic_df[titanic_df['Age'] > 60][['Name','Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [109]:
# loc를 사용하여 'Age' 열의 값이 60보다 큰 행들을 선택하고, 'Name'과 'Age' 열을 선택 -> 단 한 번의 선택 작업
titanic_df.loc[titanic_df['Age'] > 60, ['Name','Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

### 복수 조건

In [110]:
# 'Age' 값이 60보다 크면서 'Pclass' 값이 1이고, 'Sex' 값이 'female'인 조건을 만족하는 행만 선택
titanic_df[ (titanic_df['Age'] > 60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

In [111]:
# 개별 조건을 변수에 할당
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass']==1
cond3 = titanic_df['Sex']=='female'
titanic_df[ cond1 & cond2 & cond3]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

# 정렬, Aggregation함수, GroupBy 적용

## DataFrame, Series의 정렬 - sort_values()

**sort_values()**

- by: 정렬 기준이 되는 열(들)의 이름을 지정, 단일 열이나 여러 열을 기준으로 정렬 가능
- ascending: 정렬 순서를 결정, 기본값은 True(오름차순)
- axis: 정렬할 축을 지정, 0은 행을 따라 정렬하고 1은 열을 따라 정렬 (기본값은 0)
- ignore_index: 인덱스를 재설정할지 여부를 결정, 기본값은 False(원래 인덱스를 유지)
- inplace: 기본값은 False(정렬된 결과를 반환), True로 지정하면 원본 데이터프레임이 정렬된 결과로 변경

### 단일 컬럼 정렬

In [114]:
# 데이터프레임을 'Name' 열을 기준으로 정렬, 오름차순, 원본 데이터프레임 유지
titanic_sorted = titanic_df.sort_values(by=['Name'])

titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3  Abbing, Mr....    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3  Abbott, Mr....    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs...  female  35.0      1      1  C.A. 2673  20.25   NaN        S

### 복수 컬럼 정렬

In [115]:
# 'Pclass', 'Name' 열을 기준으로 정렬, 내림차순, 원본 데이터프레임 유지
titanic_sorted = titanic_df.sort_values(by=['Pclass', 'Name'], ascending=False)
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch    Ticket  Fare Cabin Embarked
868          869         0       3  van Melkebe...  male   NaN      0      0    345777   9.5   NaN        S
153          154         0       3  van Billiar...  male  40.5      0      2  A/5. 851  14.5   NaN        S
282          283         0       3  de Pelsmaek...  male  16.0      0      0    345778   9.5   NaN        S

## Aggregation 함수 적용

### 모든 컬럼에 적용

In [116]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

### 특정 컬럼에 적용

In [117]:
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

## groupby() 이용하기

DataFrame을 특정 열(단일 또는 복수)의 값에 따라 그룹으로 나눈 후 각 그룹에 대해 연산을 수행 가능

In [118]:
# 'Pclass'를 기준으로 그룹화
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [120]:
# 'Pclass' 열을 기준으로 그룹화한 후 각 그룹의 값의 빈도를 계산
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

In [123]:
# 'Pclass' 열을 기준으로 그룹화한 후 'PassengerId'와 'Survived' 열만 선택, 각 그룹의 값의 빈도 계산
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [125]:
# 'Pclass' 열을 기준으로 그룹화한 후 각 그룹에서 'Age' 열의 최댓값과 최솟값을 계산
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [ ]:
# 'Pclass' 열을 기준으로 그룹화한 후 각 그룹에서 'Age' 열의 최댓값, 'SibSp' 열의 합, 'Fare' 열의 평균을 계산
agg_format={'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

# 결손 데이터 처리하기

## isna()로 결손 데이터 여부 확인

각 요소가 결측값(NaN 또는 None)인지 여부를 나타내는 불리언 값으로 이루어진 새로운 객체를 반환

In [126]:
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

In [129]:
# 결측값 개수 합계 계산
titanic_df.isna( ).sum( )

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## fillna( ) 로 Missing 데이터 대체하기

결측값(NaN 또는 None)을 다른 값으로 채우기

In [131]:
# 결측값을 'C000'으로 채움
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')

titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500  C000        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250  C000        S

In [133]:
# 'Age' 열의 결측값을 'Age' 열의 평균값으로 채움
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())

# 'Embarked' 열의 결측값을 'S'로 채움
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')

titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

# apply lambda 식으로 데이터 가공

### 함수 예제 - 제곱값 반환

In [ ]:
def get_square(a):
    return a**2

print('3의 제곱은:',get_square(3))

### 람다식 예제1 - 제곱값 반환

In [ ]:
lambda_square = lambda x : x ** 2
print('3의 제곱은:',lambda_square(3))

### 람다식 예제2 - map 활용

map 함수를 통해 a의 리스트의 모든 요소에 람다식을 적용

In [134]:
a=[1,2,3]
squares = map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

### DataFrame의 apply에 lambda식을 적용

**apply()** 함수는 각 요소에 대해 사용자가 지정한 함수를 적용하는 데 사용

In [138]:
# 람다식을 이용해 'Name' 열의 각 요소에 대해 문자열의 길이를 계산하여 새로운 열 'Name_len'의 값으로 할당
titanic_df['Name_len']= titanic_df['Name'].apply(lambda x : len(x))

titanic_df[['Name','Name_len']].head(3)

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22

### Lambda식에서 if else 사용

In [137]:
# 람다식을 이용해 'Age' 열의 각 요소에 대해 값이 15 이하이면 'Child'를, 그렇지 않으면 'Adult'를 새로운 열 'Child_Adult'의 값으로 할당
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x <=15 else 'Adult' )

titanic_df[['Age','Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [ ]:
# 'Age' 열의 값이 15 이하이면, 'Child', 60 이하이면 'Adult', 그렇지 않으면 'Elderly'를 새로운 열 'Age_cat'의 값으로 할당
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x <= 60 else 
                                                                                  'Elderly'))
titanic_df['Age_cat'].value_counts()

하지만, **세분화**된 분류에는 **함수**를 사용하는 편이 좋음

In [140]:
# 나이에 따라 세분화된 분류를 수행하는 함수 생성
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else : cat = 'Elderly'
    
    return cat

# lambda 식에 위에서 생성한 get_category( ) 함수를 반환값으로 지정
# get_category(X)는 입력값으로 'Age' 컬럼 값을 받아서 해당하는 cat 반환
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))

titanic_df[['Age','Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult